PH_data/alpha_0.45/0/TauDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      TauDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<symmTensor>
9882
(
( 3.445860273e-07 5.40310352e-10 -9.755854791e-09 2.775893404e-10 1.048855794e-11 3.3345259e-07 )
( 1.25249187e-06 3.407202076e-09 -3.406627869e-08 2.399685561e-09 1.755262741e-10 1.213041287e-06 )
( 3.473772097e-07 5.479859344e-10 -9.625570563e-09 2.762355622e-10 -5.785958952e-12 3.380349085e-07 )
( 3.139175305e-06 1.341549627e-08 -8.087132386e-08 1.403864225e-08 9.568145165e-10 3.046042821e-06 )
( 1.261417424e-06 3.449581287e-09 -3.393347114e-08 2.403330424e-09 7.578776495e-11 1.229125814e-06 )
( 3.494452869e-07 5.962844107e-10 -9.496972986e-09 2.821294032e-10 -3.974665042e-11 3.424642046e-07 )
( 5.801320185e-06 3.309067864e-08 -1.403738423e-07 5.321804508e-08 2.927401876e-09 5.653202606e-06 )
( 3.16089745e-06 1.373170555e-08 -8.140049346e-08 1.415352191e-08 5.816438997e-10 3.086753168e-06 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 0 0 0 );
    }
}


// ************************************************************************* //
