PH_data/alpha_0.45/0/UDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
9882
(
( -0.0004558893852 4.905145943e-07 4.261141839e-06 )
( -0.000963707047 1.212418169e-06 9.137238521e-06 )
( -0.0004583884729 5.018333695e-07 4.320414064e-06 )
( -0.001682780567 2.951653187e-06 1.624933975e-05 )
( -0.0009687194834 1.23581367e-06 9.393500477e-06 )
( -0.0004609494063 5.061217507e-07 4.629753676e-06 )
( -0.002461122582 5.589170541e-06 2.43959912e-05 )
( -0.001691020327 3.005043254e-06 1.682959191e-05 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
